# DefinitionGroup Properties

---
The DefinitionGroup type exposes the following members.
| Name| Description
---|---|---
| Definitions| The Definitions property returns an object that contains all the shared parameter definitions within the group.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| Name| Returns the name of the parameter group.
Top
#### Reference
DefinitionGroup Class
Autodesk.Revit.DB Namespace